app/controllers/posts_controller.rb

INSERT INTO "posts" ("article", "author", "created_at", "titre", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article", ""], ["author", ""], ["created_at", "2014-10-17 16:25:16.578213"], ["titre", ""], ["updated_at", "2014-10-17 16:25:16.578213"]]
---
  def create
    @post = Post.new(post_params)

    @post.author = current_user.email

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "article" = ?, "titre" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["article", "Voici mon premier article dans ce blog"], ["titre", "1er Article"], ["updated_at", "2015-01-10 17:47:59.347990"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)